Revit 2027 API
EffectInstance.IsValid Method
 Tests whether the effect instance is valid for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the effect instance is valid for rendering, false otherwise.
Remarks
 The effect instances are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each effect instance for validity before using it when submitting geometry. If the effect instance becomes invalid, the application should re-create it.
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace